[
  {
    "date": "2025",
    "title": "designer",
    "company": " Life Makers Foundation – Egypt:",
    "description": [
      "Spearheaded visual design for seasonal campaigns (Ramadan, Eid Al-Adha, Mother’s Day, PalmDay).",
      " Developed a unified visual identity for all promotional materials (annual reports, brochures, ads)",
      " Managed high-pressure design projects while maintaining creative excellence",
      " Collaborated with marketing/content teams to transform ideas into impactful visuals"
    ]
  },
  {
    "date": "2024",
    "title": "Account Manager & Marketing Team Leader",
    "company": "Saudi Market - SEEN Company:",
    "description": [
      "Successfully managed a digital marketing team responsible for 14 projects across various industries.",
      "Achieved significant milestones in both organic growth and paid campaign success, driving measurable business results.",
      "Enhanced organic growth by optimizing content, improving SEO, and increasing audience engagement."
    ]
  },
  {
    "date": "2023",
    "title": "Social Media Specialist",
    "company": " Egypt - Market - Mi tutor Academy :",
    "description": [
      "Contributed to the development of the academy by creating educational and marketing content tailored to target audiences.",
      "Managed advertising campaigns to effectively reach prospective clients, resulting in significant growth and measurable success for the academy."
    ]
  },
  {
    "date": "2023",
    "title": "Graphic designer",
    "company": "Feroz Agency (Customs Office - Suez):",
    "description": [
      " Designed promotional and advertising materials aligned with the customs company’s branding.",
      " Developed creative designs for the office’s services (e.g., brochures, business cards, billboards,and social media content).",
      " Enhanced the quality of the office’s visual presentations, contributing to its "
    ]
  },
  {
    "date": "2023",
    "title": "Graphic designer5",
    "company": " Egypt - Market -AFS & Experience:",
    "description": [
      " Worked as a graphic designer, creating visually appealing designs for marketing materials.",
      "Also coordinated the design and production of brochures, ensuring alignment with brand guidelines and marketing objectives."
    ]
  }
]
